In [2]:
import sqlite3 as sql
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
with sql.connect("./e_sections/some_data.db") as con:
    df = pd.read_sql("select * from some_data", con)

df

    name sex  age  salary
0  Jared   M   23   20000
1   Lisa   F   32   40000
2    Jan   F   45   65000
3  Peter   M   12   10000
4    Ben   M   67  100000

In [ ]:
plt.plot([df[i] for i in 'age', 'salary'])